Процедура SGTIN_From_DataMatrix(Код)
	ДлинаКодаДляЛекарств = 85;
	ДлинаКода = СтрДлина(Код);
	Если ДлинаКода = ДлинаКодаДляЛекарств Тогда
		НачКодТовара = СтрНайти(Код, "01");
		Смещение = 2;
		ДлинаКодТовара = 14;
		КодТовара = Сред(Код, НачКодТовара + Смещение, ДлинаКодТовара);
		Код = Сред(Код, НачКодТовара + Смещение + ДлинаКодТовара, ДлинаКода);
		НачСН = СтрНайти(Код, "21");
		ДлинаСН = 13;
		СерийныйНомер = Сред(Код, НачСН + Смещение, ДлинаСН);
		SGTIN = КодТовара + СерийныйНомер;
	Иначе
		Сообщить("Вы сканировали не лекарство.");
	КонецЕсли;	
	Сообщить(SGTIN);
КонецПроцедуры

Код = АргументыКоманднойСтроки[0];
SGTIN_From_DataMatrix(Код);